# ==========================================
# โจทย์ข้อที่ 3: คำนวณราคาสินค้าตามสถานะสมาชิก
# Input: บรรทัดที่ 1 ราคาสินค้าเต็ม (price), บรรทัดที่ 2 สถานะสมาชิก (is_member: 1 คือเป็นสมาชิก, 0 คือไม่เป็น)
# Output: ราคาสินค้าสุทธิ (หากเป็นสมาชิก ลดทันที 10%)
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
price = float(input("กรอกราคาสินค้า:"))
is_member = int(input("สถานะสมาชิก(1คือ เป็นสมาชิก, 0 คือไม่เป็นสมาชิก):"))
net_price = price * 10/100
if is_member==1 :
    print("net_price")

else :
    print("price")

